; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob2965) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 distributor0)
	(clear pallet1)
	(at pallet2 distributor1)
	(clear crate5)
	(at pallet3 depot0)
	(clear pallet3)
	(at pallet4 distributor0)
	(clear crate6)
	(at pallet5 depot0)
	(clear crate7)
	(at truck0 depot0)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 depot0)
	(on crate1 crate0)
	(at crate2 depot0)
	(on crate2 pallet5)
	(at crate3 distributor0)
	(on crate3 pallet4)
	(at crate4 depot0)
	(on crate4 crate1)
	(at crate5 distributor1)
	(on crate5 pallet2)
	(at crate6 distributor0)
	(on crate6 crate3)
	(at crate7 depot0)
	(on crate7 crate2)
)

(:goal (and
		(on crate0 pallet5)
		(on crate1 pallet4)
		(on crate2 crate1)
		(on crate3 crate4)
		(on crate4 crate0)
		(on crate6 crate7)
		(on crate7 pallet0)
	)
))

; plan
1. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 0 of 7
2. (lift hoist1 crate6 crate3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate3)
   added: (lifting hoist1 crate6) (clear crate3)
   goals met: 0 of 7
3. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   goals met: 0 of 7
4. (lift hoist1 crate3 pallet4 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 pallet4)
   added: (lifting hoist1 crate3) (clear pallet4)
   goals met: 0 of 7
5. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   goals met: 0 of 7
6. (lift hoist0 crate4 crate1 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate1)
   added: (lifting hoist0 crate4) (clear crate1)
   goals met: 0 of 7
7. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 0 of 7
8. (drop hoist0 crate4 crate7 depot0)
   deleted: (lifting hoist0 crate4) (clear crate7)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate7)
   goals met: 0 of 7
9. (lift hoist0 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 crate0)
   added: (lifting hoist0 crate1) (clear crate0)
   goals met: 0 of 7
10. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 0 of 7
11. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 7
12. (unload hoist1 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 0 of 7
13. (drop hoist1 crate1 pallet4 distributor0)
   deleted: (lifting hoist1 crate1) (clear pallet4)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 pallet4)
   goals met: 1 of 7
14. (lift hoist0 crate4 crate7 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate7)
   added: (lifting hoist0 crate4) (clear crate7)
   goals met: 1 of 7
15. (drop hoist0 crate4 crate0 depot0)
   deleted: (lifting hoist0 crate4) (clear crate0)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate0)
   goals met: 2 of 7
16. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 2 of 7
17. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 2 of 7
18. (drop hoist0 crate3 crate4 depot0)
   deleted: (lifting hoist0 crate3) (clear crate4)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate4)
   goals met: 3 of 7
19. (lift hoist0 crate7 crate2 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate2)
   added: (lifting hoist0 crate7) (clear crate2)
   goals met: 3 of 7
20. (drop hoist0 crate7 crate3 depot0)
   deleted: (lifting hoist0 crate7) (clear crate3)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 crate3)
   goals met: 3 of 7
21. (lift hoist0 crate2 pallet5 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet5)
   added: (lifting hoist0 crate2) (clear pallet5)
   goals met: 3 of 7
22. (load hoist0 crate2 truck1 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck1) (available hoist0)
   goals met: 3 of 7
23. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 3 of 7
24. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 3 of 7
25. (unload hoist1 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   goals met: 3 of 7
26. (drop hoist1 crate2 crate1 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate1)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate1)
   goals met: 4 of 7
27. (drop hoist0 crate6 crate7 depot0)
   deleted: (lifting hoist0 crate6) (clear crate7)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate7)
   goals met: 5 of 7
28. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 5 of 7
29. (lift hoist0 crate6 crate7 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate7)
   added: (lifting hoist0 crate6) (clear crate7)
   goals met: 4 of 7
30. (drop hoist0 crate6 pallet3 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet3)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet3)
   goals met: 4 of 7
31. (lift hoist0 crate7 crate3 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate3)
   added: (lifting hoist0 crate7) (clear crate3)
   goals met: 4 of 7
32. (drop hoist0 crate7 crate6 depot0)
   deleted: (lifting hoist0 crate7) (clear crate6)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 crate6)
   goals met: 4 of 7
33. (lift hoist0 crate3 crate4 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate4)
   added: (lifting hoist0 crate3) (clear crate4)
   goals met: 3 of 7
34. (drop hoist0 crate3 crate7 depot0)
   deleted: (lifting hoist0 crate3) (clear crate7)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate7)
   goals met: 3 of 7
35. (lift hoist0 crate4 crate0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate0)
   added: (lifting hoist0 crate4) (clear crate0)
   goals met: 2 of 7
36. (drop hoist0 crate4 crate3 depot0)
   deleted: (lifting hoist0 crate4) (clear crate3)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate3)
   goals met: 2 of 7
37. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 2 of 7
38. (drop hoist0 crate0 pallet5 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet5)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet5)
   goals met: 3 of 7
39. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   goals met: 3 of 7
40. (drop hoist0 crate4 crate0 depot0)
   deleted: (lifting hoist0 crate4) (clear crate0)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate0)
   goals met: 4 of 7
41. (lift hoist0 crate3 crate7 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate7)
   added: (lifting hoist0 crate3) (clear crate7)
   goals met: 4 of 7
42. (drop hoist0 crate3 crate4 depot0)
   deleted: (lifting hoist0 crate3) (clear crate4)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate4)
   goals met: 5 of 7
43. (lift hoist0 crate7 crate6 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate6)
   added: (lifting hoist0 crate7) (clear crate6)
   goals met: 5 of 7
44. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 6 of 7
45. (lift hoist0 crate6 pallet3 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 pallet3)
   added: (lifting hoist0 crate6) (clear pallet3)
   goals met: 6 of 7
46. (drop hoist0 crate6 crate7 depot0)
   deleted: (lifting hoist0 crate6) (clear crate7)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate7)
   goals met: 7 of 7
